<template>
    <div class="faq">
        <div class="container">
            <div class="row">
                <div class="col-12">
                    <p class="my-head-text">Вопрос-ответ</p>
                </div>
                <div class="col-8">
                    <ul class="list-faq">
                        <li v-for="index in list" :key="index.id">
                            <div class="faq-title"
                                 @click="contentVisible === index.id ? contentVisible = false : contentVisible = index.id">
                                <div class="row">
                                    <div class="col-12">
                                        {{index.title }}
                                    </div>
                                </div>
                            </div>

                            <transition name="fade">
                                <p class="faq-body" v-if='contentVisible === index.id'>{{ index.text }}</p>
                            </transition>
                        </li>
                    </ul>
                </div>
            </div>
        </div>

    </div>
</template>

<script>
    export default {
        name: "FAQ",
        data() {
            return {
                contentVisible: false,
                list: [
                    {
                        id: "1",
                        title: "В чем отличие фотографий из воинской части от фотографий \n" +
                            "из военкомата?",
                        text: "Наши фотографы для съемки разворачивают полноценную фото студию, чего не делают фотографы в военкоматах, \n" +
                            "это заметно невооруженным взглядом - качество фотографий гораздо выше. На одном из наших фото есть фон города, \n" +
                            "в котором служит солдат. \n" +
                            "\n" +
                            "Для фонов мы всегда используем технику и оружие, актуальные для воинской части. Продуманный дизайн, мужественные образы и безупречное техническое исполнение - вот что отличает наши фотографии. Кроме того, наши фотографии покрыты тонким слоем ламинации, что позволяет им надолго сохранить цвета, яркость и насыщенность. \n" +
                            "Если Вы приобрели у нас фотографии, их электронный вид мы отправим\n" +
                            "Вам совершенно бесплатно на электронную почту."
                    },
                    {
                        id: "2",
                        title: "Снимали ли Вы присягу моего сына? \n" +
                            "Как заказать фильм?",
                        text: "Наши фотографы для съемки разворачивают полноценную фото студию, чего не делают фотографы в военкоматах, \n" +
                            "это заметно невооруженным взглядом - качество фотографий гораздо выше. На одном из наших фото есть фон города, \n" +
                            "в котором служит солдат. \n" +
                            "\n" +
                            "Для фонов мы всегда используем технику и оружие, актуальные для воинской части. Продуманный дизайн, мужественные образы и безупречное техническое исполнение - вот что отличает наши фотографии. Кроме того, наши фотографии покрыты тонким слоем ламинации, что позволяет им надолго сохранить цвета, яркость и насыщенность. \n" +
                            "Если Вы приобрели у нас фотографии, их электронный вид мы отправим\n" +
                            "Вам совершенно бесплатно на электронную почту."
                    },
                    {
                        id: "3",
                        title: "Как купить фото в электронном виде?\n" +
                            "Как скачать видео и фото-материалы?",
                        text: "Наши фотографы для съемки разворачивают полноценную фото студию, чего не делают фотографы в военкоматах, \n" +
                            "это заметно невооруженным взглядом - качество фотографий гораздо выше. На одном из наших фото есть фон города, \n" +
                            "в котором служит солдат. \n" +
                            "\n" +
                            "Для фонов мы всегда используем технику и оружие, актуальные для воинской части. Продуманный дизайн, мужественные образы и безупречное техническое исполнение - вот что отличает наши фотографии. Кроме того, наши фотографии покрыты тонким слоем ламинации, что позволяет им надолго сохранить цвета, яркость и насыщенность. \n" +
                            "Если Вы приобрели у нас фотографии, их электронный вид мы отправим\n" +
                            "Вам совершенно бесплатно на электронную почту.s"
                    }
                ]
            };
        }
    }
</script>

<style scoped>
    /*.fade-enter-active, .fade-leave-active {*/
    /*    transition: opacity .5s;*/
    /*}*/

    /*.fade-enter, .fade-leave-to {*/
    /*    opacity: 0;*/
    /*}*/
</style>